In [2]:
import pandas as pd 
import numpy as np

In [3]:
data = {'Voter_name': ['Geek1', 'Geek2', 'Geek3', 'Geek4',  
                           'Geek5', 'Geek6', 'Geek7', 'Geek8'],  
            'Voter_age': [15, 23, 25, 9, 67, 54, 42, np.NaN]}

In [6]:
df = pd.DataFrame(data, columns=['Voter_name', 'Voter_age'])

In [7]:
df.head()

  Voter_name  Voter_age
0      Geek1       15.0
1      Geek2       23.0
2      Geek3       25.0
3      Geek4        9.0
4      Geek5       67.0

In [8]:
eligible=[]

for age in df['Voter_age']:
    if age >= 18:
        eligible.append('Yes')
    elif age<18 :
        eligible.append('No')
    else:
        eligible.append('Not Sure')

df['Voter']=eligible

print(df)

  Voter_name  Voter_age     Voter
0      Geek1       15.0        No
1      Geek2       23.0       Yes
2      Geek3       25.0       Yes
3      Geek4        9.0        No
4      Geek5       67.0       Yes
5      Geek6       54.0       Yes
6      Geek7       42.0       Yes
7      Geek8        NaN  Not Sure

In [11]:
## How to get column names in pandas 
list(df.columns)

['Voter_name', 'Voter_age', 'Voter']

In [14]:
for col in df.columns:
    print(col)

Voter_name
Voter_age
Voter

In [16]:
## Rename a column in pandas dataframe 
import pandas as pd

# Define a dictionary containing ICC rankings
rankings = {'test': ['India', 'South Africa', 'England',
                            'New Zealand', 'Australia'],
            'odi': ['England', 'India', 'New Zealand',
                            'South Africa', 'Pakistan'],
            't20': ['Pakistan', 'India', 'Australia',
                            'England', 'New Zealand']}

# Convert the dictionary into DataFrame
rankings_pd = pd.DataFrame(rankings)

rankings_pd.rename(columns={'test':'TEST'},inplace=True)
print(rankings_pd)

           TEST           odi          t20
0         India       England     Pakistan
1  South Africa         India        India
2       England   New Zealand    Australia
3   New Zealand  South Africa      England
4     Australia      Pakistan  New Zealand

In [21]:
## Collapsing multiple columns into 1
import pandas as pd 
df = pd.DataFrame({'First':['Manan','Raghav','Sunny'],
                  'Last':['Goel','Sharma','Chawla'],
                  'Age':[12,24,56]})

print(df)
# mapping = {'First':'Full Name', 'Last':'Full Name'}

# df = df.set_index('Age').groupby(mapping, axis=1).sum()

# df.reset_index(level=0)

    First    Last  Age
0   Manan    Goel   12
1  Raghav  Sharma   24
2   Sunny  Chawla   56

In [23]:
df.head()
df["Full Name"] = df["First"]+ df["Last"]

In [25]:
df.head()

    First    Last  Age     Full Name
0   Manan    Goel   12     MananGoel
1  Raghav  Sharma   24  RaghavSharma
2   Sunny  Chawla   56   SunnyChawla

In [26]:
## How we can get unique values of any column in a data frame

In [27]:
## We can get the unique values of any column in a dataframe by 
## df.ColumnName.unique()

In [29]:
import pandas as pd 
data = {
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B4'],
    'C': ['C1', 'C2', 'C3', 'C3', 'C3'],
    'D': ['D1', 'D2', 'D2', 'D2', 'D2'],
    'E': ['E1', 'E1', 'E1', 'E1', 'E1']}

df = pd.DataFrame(data)

In [31]:
df.B.unique()

array(['B1', 'B2', 'B3', 'B4'], dtype=object)

In [33]:
df.E.unique()

array(['E1'], dtype=object)

In [35]:
df.C.nunique(dropna=True)

3

In [37]:
## How to eliminate duplicate values from a column using set()

In [39]:
unique_values_set= set(df['C'])

print(unique_values_set)

{'C2', 'C3', 'C1'}

In [40]:
## How can we remove duplicated from the dataframe

In [42]:
import pandas as pd 
df = pd.DataFrame(data)
df['A'] = df['A'].drop_duplicates()
df['D'] = df['D'].drop_duplicates()

print(df)

    A   B   C    D   E
0  A1  B1  C1   D1  E1
1  A2  B2  C2   D2  E1
2  A3  B3  C3  NaN  E1
3  A4  B4  C3  NaN  E1
4  A5  B4  C3  NaN  E1

In [43]:
## Conditional operations on columns

In [44]:
# importing pandas as pd
import pandas as pd
 
# Create the dataframe
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':['Umbrella', 'Mattress', 'Badminton', 'Shuttle'],
                   'Last Price':[1200, 1500, 1600, 352],
                   'Updated Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 10, 10, 10]})
 
# Print the dataframe
print(df)

        Date    Product  Last Price  Updated Price  Discount
0  10/2/2011   Umbrella        1200           1250        10
1  11/2/2011   Mattress        1500           1450        10
2  12/2/2011  Badminton        1600           1550        10
3  13/2/2011    Shuttle         352            400        10

In [46]:
if 'Updated Price' in df.columns:
    df['Final cost'] = df['Updated Price'] - (df['Updated Price']*0.1)
else:
    df['Final cost'] = df['Last Price'] - (df['Last Price']*0.1)
    
print(df)

        Date    Product  Last Price  Updated Price  Discount  Final cost
0  10/2/2011   Umbrella        1200           1250        10      1125.0
1  11/2/2011   Mattress        1500           1450        10      1305.0
2  12/2/2011  Badminton        1600           1550        10      1395.0
3  13/2/2011    Shuttle         352            400        10       360.0

In [47]:
# importing pandas as pd
import pandas as pd
 
# Create the dataframe
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':['Umbrella', 'Mattress', 'Badminton', 'Shuttle'],
                   'Last_Price':[1200, 1500, 1600, 352],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 10, 10, 10]})
 
# Create the indexes
df.index =['Item 1', 'Item 2', 'Item 3', 'Item 4']
 
# Print the dataframe
print(df)

             Date    Product  Last_Price  Updated_Price  Discount
Item 1  10/2/2011   Umbrella        1200           1250        10
Item 2  11/2/2011   Mattress        1500           1450        10
Item 3  12/2/2011  Badminton        1600           1550        10
Item 4  13/2/2011    Shuttle         352            400        10

In [55]:
Indexed_label = df[df['Updated_Price']>1000].index.tolist()
print(Indexed_label)

['Item 1', 'Item 2', 'Item 3']

In [58]:
import pandas as pd 

df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':['Umbrella', 'Mattress', 'Badminton', 'Shuttle'],
                   'Last_Price':[1200, 1500, 1600, 352],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 10, 10, 10]})

df.index=['Item1', 'Item2','Item3', 'Item4']
print(df)

            Date    Product  Last_Price  Updated_Price  Discount
Item1  10/2/2011   Umbrella        1200           1250        10
Item2  11/2/2011   Mattress        1500           1450        10
Item3  12/2/2011  Badminton        1600           1550        10
Item4  13/2/2011    Shuttle         352            400        10

In [63]:
d1 = df[df["Updated_Price"] > 1000].index.tolist()
print(d1)

['Item1', 'Item2', 'Item3']

In [64]:
## using dictioanary to replace the values in a pandas dataframe columns

In [65]:
import pandas as pd

df = pd.DataFrame({'Date': ['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Event': ['Music', 'Poetry', 'Theatre', 'Comedy'],
                   'Cost': [10000, 5000, 15000, 2000]})

# Print the dataframe
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [67]:
dict={'Music':'M', 'Poetry':'P', 'Theatre':'T','Comedy':'C'}
print(dict)
df.replace({"Event":dict})

{'Music': 'M', 'Poetry': 'P', 'Theatre': 'T', 'Comedy': 'C'}

        Date Event   Cost
0  10/2/2011     M  10000
1  11/2/2011     P   5000
2  12/2/2011     T  15000
3  13/2/2011     C   2000

####  Create a new column in Pandas DataFrame based on the existing columns

In [68]:
import pandas as pd

# Creating the DataFrame
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})

# Print the dataframe
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [70]:
## Now we can use apply function to create a new column and applying operation on it 
df['Discounted_Price']= df.apply(lambda row:row.Cost - (row.Cost*0.1) , axis=1)
print(df)

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

In [71]:
# We can achieve the same result by directly performing the required operation on the desired column

In [73]:
import pandas as pd

# Creating the DataFrame
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})

# Create a new column 'Discounted_Price' after applying
# 10% discount on the existing 'Cost' column.
df['Discounted_Price'] = df['Cost']-(0.1*df['Cost'])
print(df)

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

In [74]:
# Using dataframe.map() function to create new column from existing column using a mapping function 
data = {
    "name": ["John", "Ted", "Dev", "Brad", "Rex", "Smith", "Samuel", "David"],
    "salary": [10000, 20000, 50000, 45500, 19800, 95000, 5000, 50000]
}
# create dataframe from data dictionary
df = pd.DataFrame(data)
# print the dataframe
display(df.head())

   name  salary
0  John   10000
1   Ted   20000
2   Dev   50000
3  Brad   45500
4   Rex   19800

In [76]:
def salary_stats(value):
    if value < 10000:
        return "Very Low"
    if 10000<= value<25000:
        return "Low"
    elif 25000<=value<40000:
        return "average"
    elif 40000<=value<50000:
        return "better"
    elif value>=50000:
        return "very good"
    
df['salary_stats'] = df['salary'].map(salary_stats)
display(df.head())

   name  salary salary_stats
0  John   10000          Low
1   Ted   20000          Low
2   Dev   50000    very good
3  Brad   45500       better
4   Rex   19800          Low

## Creating a dataframe column based on several given conditions

In [77]:
## We can apply 
# 1)List Comprehension 
# 2)DataFrame.apply()
# 3)DataFrame.map()
# 4)numpy.where()
# 5)Lambda Function

In [78]:
# importing pandas as pd
import pandas as pd

# Creating the dataframe
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011',
                            '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})

# Print the dataframe
print(df)

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

In [89]:
df['Price']=[1500 if x=="Music" else 800 for x in df['Event']]

print(df)

         Date   Event Priority  Price
0   11/8/2011   Music     High   1500
1   11/9/2011  Poetry      Low    800
2  11/10/2011   Music     High   1500
3  11/11/2011  Comedy      Low    800
4  11/12/2011  Poetry      Low    800

In [90]:
event_dictionary = {'Music': 1500 , 'Poetry': 800 ,'Comedy':1200}

df['Price'] = df['Event'].map(event_dictionary)

print(df)

         Date   Event Priority  Price
0   11/8/2011   Music     High   1500
1   11/9/2011  Poetry      Low    800
2  11/10/2011   Music     High   1500
3  11/11/2011  Comedy      Low   1200
4  11/12/2011  Poetry      Low    800

In [91]:
df['Price'] = np.where(df['Event']=='Music',1500,800)

In [92]:
print(df)

         Date   Event Priority  Price
0   11/8/2011   Music     High   1500
1   11/9/2011  Poetry      Low    800
2  11/10/2011   Music     High   1500
3  11/11/2011  Comedy      Low    800
4  11/12/2011  Poetry      Low    800

In [93]:
##A new column ‘Priority’ is created based on the condition: if the ‘Event’ is ‘Music’, the priority is set to ‘High’, otherwise, it’s set to ‘Low’
df = pd.DataFrame({'Date': ['11/8/2011', '11/9/2011', '11/10/2011', '11/11/2011', '11/12/2011'],
                   'Event': ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})

df['Priority'] = df['Event'].apply(lambda x:'High' if x=='Music' else 'Low')

print(df)

         Date   Event Priority
0   11/8/2011   Music     High
1   11/9/2011  Poetry      Low
2  11/10/2011   Music     High
3  11/11/2011  Comedy      Low
4  11/12/2011  Poetry      Low

In [1]:
## Split a column in Pandas dataframe and get part of it

In [7]:
import pandas as pd 
import numpy as np 
df = pd.DataFrame({'Geek_ID':['Geek1_id','Geek2_id','Geek3_id','Geek4_id','Geek5_id'],
                   'Geek_A':[1,1,3,2,4],
                   'Geek_B':[1,2,3,4,6],
                   'Geek_R':np.random.randn(5)})
print(df.Geek_ID.str.split('_').str[0])
print(df.Geek_ID.str.split('_').str[0].tolist())

0    Geek1
1    Geek2
2    Geek3
3    Geek4
4    Geek5
Name: Geek_ID, dtype: object
['Geek1', 'Geek2', 'Geek3', 'Geek4', 'Geek5']

In [18]:
import pandas as pd 
import numpy as np 
df = pd.DataFrame({'Geek_ID':['Geek1_id_1_1','Geek2_id_2_2','Geek3_id_3_3','Geek4_id_4_4','Geek5_id_5_5'],
                   'Geek_A':[1,1,3,2,4],
                   'Geek_B':[1,2,3,4,6],
                   'Geek_R':np.random.randn(5)})
print(df.Geek_ID.str.split('_'))

0    [Geek1, id, 1, 1]
1    [Geek2, id, 2, 2]
2    [Geek3, id, 3, 3]
3    [Geek4, id, 4, 4]
4    [Geek5, id, 5, 5]
Name: Geek_ID, dtype: object

In [20]:
import pandas as pd 
gapminder_csv_url = 'http://bit.ly/2cLzoxH'
record = pd.read_csv(gapminder_csv_url)
record.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [22]:
record['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [24]:
record['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo Dem. Rep.', 'Congo Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea Dem. Rep.',
       'Korea Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [26]:
record['country'].nunique()

142

In [28]:
record['country'].value_counts()

Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: country, Length: 142, dtype: int64

In [30]:
record.describe()

             year           pop      lifeExp      gdpPercap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [31]:
## Getting a freuqncy counts of a columns in Pandas DataFrame

In [40]:
## M1 series.value_counts()
import pandas as pd 
df = pd.DataFrame({'A': ['foo', 'bar', 'g2g', 'g2g', 'g2g', 
                         'bar', 'bar', 'foo', 'bar'], 
                  'B': ['a', 'b', 'a', 'b', 'b', 'b', 'a', 'a', 'b'] })


print(df)
## frequency count of column A
count = df['A'].value_counts()
print(count)

     A  B
0  foo  a
1  bar  b
2  g2g  a
3  g2g  b
4  g2g  b
5  bar  b
6  bar  a
7  foo  a
8  bar  b
bar    4
g2g    3
foo    2
Name: A, dtype: int64

In [36]:
## M-2 using groupby.count()
##This method can be used to count frequncies of objects over single columns 
import pandas as pd 

df = pd.DataFrame({'A': ['foo', 'bar', 'g2g', 'g2g', 'g2g', 
                                'bar', 'bar', 'foo', 'bar'], 
                   'B': ['a', 'b', 'a', 'b', 'b', 'b', 'a', 'a', 'b'] })

count = df.groupby(['A']).count()
print(count)

     B
A
bar  4
foo  2
g2g  3

In [42]:
## Using groupby.size()
## This method can be used to count frequencies of objects over single or multiple coulmns . 
import pandas as pd 
  
# sample dataframe 
df = pd.DataFrame({ 'A': ['foo', 'bar', 'g2g', 'g2g', 'g2g',  
                                'bar', 'bar', 'foo', 'bar'], 
                   'B': ['a', 'b', 'a', 'b', 'b', 'b', 'a', 'a', 'b'] }) 
  
# Multi-column frequency count 
count=df.groupby(['A','B']).size()
print(count)

A    B
bar  a    1
     b    3
foo  a    2
g2g  a    1
     b    2
dtype: int64

In [43]:
## Change data  type for one or more columns in Pandas DataFrame

In [55]:
import pandas as pd 

df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '1.0', '1.3', 2, 5]})

df['A'].astype(int)
print(df.dtypes)

A     int64
B    object
C    object
dtype: object

In [58]:
##Change column type in pandas using DataFrame.apply() 
##We can pass pandas.to_numeric, pandas.to_datetime, and pandas.to_timedelta

df['A']=df['A'].apply(pd.to_datetime)
print(df)

                              A  B    C
0 1970-01-01 00:00:00.000000001  a  1.1
1 1970-01-01 00:00:00.000000002  b  1.0
2 1970-01-01 00:00:00.000000003  c  1.3
3 1970-01-01 00:00:00.000000004  d    2
4 1970-01-01 00:00:00.000000005  e    5

In [60]:
import pandas as pd 

df = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [64]:
df.nlargest(5,['Age'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
298,Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
304,Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
400,Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0
102,Pablo Prigioni,Los Angeles Clippers,9.0,PG,39.0,6-3,185.0,NaN,947726.0
261,Vince Carter,Memphis Grizzlies,15.0,SG,39.0,6-6,220.0,North Carolina,4088019.0

In [66]:
df.nsmallest(5,['Age'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
122,Devin Booker,Phoenix Suns,1.0,SG,19.0,6-6,206.0,Kentucky,2127840.0
226,Rashad Vaughn,Milwaukee Bucks,20.0,SG,19.0,6-6,202.0,UNLV,1733040.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
40,Kristaps Porzingis,New York Knicks,6.0,PF,20.0,7-3,240.0,NaN,4131720.0
56,Jahlil Okafor,Philadelphia 76ers,8.0,C,20.0,6-11,275.0,Duke,4582680.0

In [68]:
df.nlargest(10,['Salary'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0
169,LeBron James,Cleveland Cavaliers,23.0,SF,31.0,6-8,250.0,NaN,22970500.0
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000.0
251,Dwight Howard,Houston Rockets,12.0,C,30.0,6-11,265.0,NaN,22359364.0
339,Chris Bosh,Miami Heat,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730.0
100,Chris Paul,Los Angeles Clippers,3.0,PG,31.0,6-0,175.0,Wake Forest,21468695.0
414,Kevin Durant,Oklahoma City Thunder,35.0,SF,27.0,6-9,240.0,Texas,20158622.0
164,Derrick Rose,Chicago Bulls,1.0,PG,27.0,6-3,190.0,Memphis,20093064.0
349,Dwyane Wade,Miami Heat,3.0,SG,34.0,6-4,220.0,Marquette,20000000.0
23,Brook Lopez,Brooklyn Nets,11.0,C,28.0,7-0,275.0,Stanford,19689000.0